Ran Plan for dir: `terragrunt/kubernetes/vault` workspace: `terragrunt_kubernetes_vault`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:45.499 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/30CtTB849nE7H3Lc7VJ6CCQvxOM/dx0XsuDrcgaFqq6CpYuPDl2D_hs
01:00:45.553 INFO   tofu: Initializing the backend...
01:00:45.841 INFO   tofu: Initializing provider plugins...
01:00:45.841 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:46.213 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:46.360 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:46.475 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:46.757 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:46.918 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:47.032 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:47.161 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:47.888 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:00:47.903 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:00:47.980 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:00:48.000 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:00:48.012 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:00:48.046 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:00:48.082 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:00:48.104 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:00:48.104 INFO   tofu: OpenTofu has been successfully initialized!
01:00:48.819 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:00:48.819 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:00:48.819 STDOUT tofu:   ~ update in-place
01:00:48.819 STDOUT tofu: OpenTofu will perform the following actions:
01:00:48.819 STDOUT tofu:   # helm_release.external_secrets will be updated in-place
01:00:48.819 STDOUT tofu:   ~ resource "helm_release" "external_secrets" {
01:00:48.819 STDOUT tofu:       ~ id                         = "external-secrets" -> (known after apply)
01:00:48.819 STDOUT tofu:       ~ metadata                   = {
01:00:48.819 STDOUT tofu:           ~ app_version    = "v0.19.0" -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ chart          = "external-secrets" -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ first_deployed = 1746657171 -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ last_deployed  = 1754442328 -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ name           = "external-secrets" -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ namespace      = "external-secrets" -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ revision       = 7 -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ values         = jsonencode(
01:00:48.819 STDOUT tofu:                 {
01:00:48.819 STDOUT tofu:                   - installCRDs    = true
01:00:48.819 STDOUT tofu:                   - serviceAccount = {
01:00:48.819 STDOUT tofu:                       - create = true
01:00:48.819 STDOUT tofu:                       - name   = "external-secrets"
01:00:48.819 STDOUT tofu:                     }
01:00:48.819 STDOUT tofu:                 }
01:00:48.819 STDOUT tofu:             ) -> (known after apply)
01:00:48.819 STDOUT tofu:           ~ version        = "0.19.0" -> (known after apply)
01:00:48.819 STDOUT tofu:         } -> (known after apply)
01:00:48.819 STDOUT tofu:         name                       = "external-secrets"
01:00:48.819 STDOUT tofu:       ~ version                    = "0.19.0" -> "0.19.2"
01:00:48.819 STDOUT tofu:         # (26 unchanged attributes hidden)
01:00:48.819 STDOUT tofu:     }
01:00:48.819 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:00:48.819 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/vault -w terragrunt_kubernetes_vault
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fvault%252Fterragrunt_kubernetes_vault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/vault -w terragrunt_kubernetes_vault
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```